const settings = require('./settings')

function buildMenu() {
  const { botName, botType, enlace, developer, web } = settings

  return `─── ׁ ׅ  𝐇ᴏʟᴀ!, sᴏʏ ${botName} (${botType}) . 𐔌՞ ܸ.ˬ.ܸ՞𐦯

✎ ᴀᴏ̨ᴜɪ ᴛɪᴇɴᴇs ʟᴀ ʟɪsᴛᴀ ᴅᴇ ʟᴏs ᴄᴏᴍᴀɴᴅᴏs

︵𝆣᷼ ͡︵᷼𝆣 ᷼͡︵᷼𝆣 ᷼͡︵ ᅟິᅟᅟ︵𝆣᷼ ͡︵᷼𝆣 ᷼͡︵᷼𝆣 ᷼͡︵

༉‧₊˚. │ 𝐄ɴʟᴀᴄᴇ ❚❙  ⋆˚꩜｡
── ${enlace}

༉‧₊˚. │𝐃ᴇᴠᴇʟᴏᴘᴇʀ ❚❙  ⋆˚꩜｡
── ${developer}

ᅟᅟ︶͜︶͜︶ᅟᅟ֪ᅟ֪ᅟᅟ︶͜︶͜︶

> ᴄᴏɴᴇᴄᴛᴀᴛᴇ ᴄᴏᴍᴏ sᴜʙ-ʙᴏᴛ ᴇɴ ɴᴜᴇsᴛʀᴀ ᴡᴇʙ ᴏғɪᴄɪᴀʟ ✎ ${web}

- ≽ ^⎚ ˕ ⎚^ ≼ *\`𝐀𝗇𝗂𝗆𝖾\`*  ᰨᰍ    *;*
> ✐ ᴄᴏᴍᴀɴᴅᴏs ᴅᴇ ʀᴇᴀᴄᴄɪᴏɴᴇs ᴅᴇ ᴀɴɪᴍᴇ.

  ❀  ૮₍ ˃̵͈᷄ . ฅ ₎ა   ݁  #peek + <mention>
> ── ˚. ᵎᵎ  ۠ ᴇsᴘɪᴀʀ ᴀ ᴀʟɢᴜɪᴇɴ.

  ❀  ૮₍ ˃̵͈᷄ . ฅ ₎ა   ݁  #hug + <mention>
> ── ˚. ᵎᵎ  ۠ ᴀʙʀᴀᴢᴀʀ ᴀ ᴀʟɢᴜɪᴇɴ.

  ❀  ૮₍ ˃̵͈᷄ . ฅ ₎ა   ݁  #kiss + <mention>
> ── ˚. ᵎᵎ  ۠ ʙᴇsᴀʀ ᴀ ᴀʟɢᴜɪᴇɴ.

  ❀  ૮₍ ˃̵͈᷄ . ฅ ₎ა   ݁  #pat + <mention>
> ── ˚. ᵎᵎ  ۠ ᴀᴄᴀʀɪᴄɪᴀʀ ᴀ ᴀʟɢᴜɪᴇɴ.

  ❀  ૮₍ ˃̵͈᷄ . ฅ ₎ა   ݁  #slap + <mention>
> ── ˚. ᵎᵎ  ۠ ᴅᴀʀʟᴇ ᴜɴᴀ ᴄᴀᴄʜᴇᴛᴀᴅᴀ ᴀ ᴀʟɢᴜɪᴇɴ.

  ❀  ૮₍ ˃̵͈᷄ . ฅ ₎ა   ݁  #poke + <mention>
> ── ˚. ᵎᵎ  ۠ ᴍᴏʟᴇsᴛᴀʀ ᴀ ᴀʟɢᴜɪᴇɴ.

ᅟᅟ︶͜︶͜︶ᅟᅟ﹙ ❀﹚ᅟᅟ︶͜︶͜︶

•  ≽(˵◝ ⩊  ◜˵ マ≼ \`𝐈𝐀\`  ᰨᰍ    *;*
> ✎ ʜᴀʙʟᴀ ᴄᴏɴ ɪɴᴛᴇʟɪɢᴇɴᴄɪᴀ ᴀʀᴛɪғɪᴄɪᴀʟ

 ❀  ₍ᐢ.  ̫.ᐢ₎    ݁  #chatgpt
> ✎ ʜᴀʙʟᴀ ᴄᴏɴ ᴄʜᴀᴛɢᴘᴛ

 ❀  ₍ᐢ.  ̫.ᐢ₎    ݁  #gemini
> ✎ ʜᴀʙʟᴀ ᴄᴏɴ ɢᴇᴍɪɴɪ

 ❀  ₍ᐢ.  ̫.ᐢ₎    ݁  #imagine
> ✎ ᴄʀᴇᴀ ᴜɴᴀ ɪᴍᴀɢᴇɴ ʜᴇᴄʜᴀ ᴘᴏʀ ʟᴀ ɪᴀ

ᅟᅟ︶͜︶͜︶ᅟᅟ﹙ ❀﹚ᅟᅟ︶͜︶͜︶`
}

module.exports = { buildMenu }
